[
    {
        "id":  1,
        "title":  "City Park Reopens After Renovation",
        "description":  "The central city park reopened with new accessible paths and native plantings.",
        "content":  "After a year-long community-led renovation the city park reopens with wider paths, native plant gardens, and new lighting. The project prioritized accessibility and biodiversity.",
        "date":  "2025-08-20",
        "image":  "/assets/images/example1.jpg",
        "category":  "Local"
    },
    {
        "id":  2,
        "title":  "ISRO Successfully Launches GSAT-24 Communication Satellite",
        "description":  "India\u0027s space agency deploys GSAT-24 to strengthen regional communications and broadcasting services.",
        "content":  "The Indian Space Research Organisation (ISRO) announced the successful launch of GSAT-24 today, a high-throughput communication satellite designed to expand broadcasting and digital connectivity across the region. The mission marks another milestone in ISRO\u0027s growing suite of communication satellites and follows rigorous ground testing and integration work.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?satellite,space",
        "category":  "News",
        "tags":  [
                     "ISRO",
                     "space",
                     "satellite",
                     "connectivity"
                 ],
        "slug":  "isro-successfully-launches-gsat-24",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?satellite,space"
    },
    {
        "id":  3,
        "title":  "New AI Model Exceeds GPT-5 Benchmarks in Reasoning Tests",
        "description":  "A research team publishes an AI that outperforms current benchmarks on complex reasoning tasks.",
        "content":  "A newly released AI model has demonstrated performance beyond existing benchmarks in a series of independent reasoning evaluations. The model, developed by a consortium of academic and industry researchers, showed marked improvements in multi-step reasoning, mathematical problem solving, and logical inference tasks.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?artificial-intelligence,ai",
        "category":  "News",
        "tags":  [
                     "AI",
                     "research",
                     "benchmarks",
                     "machine-learning"
                 ],
        "slug":  "new-ai-model-exceeds-gpt-5-benchmarks",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?artificial-intelligence,ai"
    },
    {
        "id":  4,
        "title":  "Apple Announces Vision Pro 2 With Major Upgrades",
        "description":  "Apple unveils the Vision Pro 2 featuring improved optics, battery life and collaborative spatial features.",
        "content":  "At a special event, Apple introduced the Vision Pro 2, the next iteration of its mixed-reality headset. The new model brings enhanced display optics, extended battery life, and hardware improvements that make long-form productivity and entertainment sessions more comfortable.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?virtual-reality,headset",
        "category":  "News",
        "tags":  [
                     "Apple",
                     "Vision Pro",
                     "VR",
                     "hardware"
                 ],
        "slug":  "apple-announces-vision-pro-2-with-major-upgrades",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?virtual-reality,headset"
    },
    {
        "id":  5,
        "title":  "India Records Highest Solar Power Production in History",
        "description":  "Nation-wide solar output peaks, reflecting rapid capacity growth and favourable weather conditions.",
        "content":  "India recorded its highest daily solar power production on record as new utility-scale projects and rooftop installations came online across multiple states. Grid operators noted a sustained period of strong solar generation, helping to reduce fossil fuel dependence during peak daylight hours.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?solar,power,panels",
        "category":  "News",
        "tags":  [
                     "solar",
                     "renewables",
                     "energy",
                     "India"
                 ],
        "slug":  "india-records-highest-solar-power-production-in-history",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?solar,power,panels"
    },
    {
        "id":  6,
        "title":  "Tesla Unveils New Electric Bike Concept in Berlin",
        "description":  "Tesla reveals an urban electric bike prototype blending the company\u0027s EV design language with lightweight e-mobility.",
        "content":  "Tesla showcased a new electric bike concept at a Berlin event, positioning the vehicle as a compact urban mobility solution. The prototype focuses on range efficiency, modular battery packs, and a simplified user interface that mirrors Tesla\u0027s EV ecosystem.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?electric-bike,bike",
        "category":  "News",
        "tags":  [
                     "Tesla",
                     "e-bike",
                     "mobility",
                     "Berlin"
                 ],
        "slug":  "tesla-unveils-new-electric-bike-concept-in-berlin",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?electric-bike,bike"
    },
    {
        "id":  7,
        "title":  "Google Adds Hindi \u0026 Tamil Support to Gemini Live AI",
        "description":  "Real-time spoken and written support for Hindi and Tamil expands Gemini Live\u0027s reach across South Asia.",
        "content":  "Google announced that Gemini Live now includes native support for Hindi and Tamil, offering both text and speech capabilities for real-time translation and conversational AI. The update is intended to make live interactions and accessibility easier across multilingual regions.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?google,ai,languages",
        "category":  "News",
        "tags":  [
                     "Google",
                     "Gemini Live",
                     "languages",
                     "Hindi",
                     "Tamil"
                 ],
        "slug":  "google-adds-hindi-tamil-support-to-gemini-live-ai",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?google,ai,languages"
    },
    {
        "id":  8,
        "title":  "Scientists Discover Earth-Like Planet in TRAPPIST-1 System",
        "description":  "A newly characterised planet in the TRAPPIST-1 system shows signs of temperate conditions and a rocky surface.",
        "content":  "Astronomers studying the TRAPPIST-1 system have confirmed an additional planet with Earth-like characteristics, including a size and estimated temperature range consistent with temperate surface conditions. The discovery was made using a combination of transit photometry and follow-up spectroscopy.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?exoplanet,space,star",
        "category":  "News",
        "tags":  [
                     "astronomy",
                     "TRAPPIST-1",
                     "exoplanet",
                     "space"
                 ],
        "slug":  "scientists-discover-earth-like-planet-in-trappist-1-system",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?exoplanet,space,star"
    },
    {
        "id":  9,
        "title":  "Meta Introduces Ultra-Realistic Avatars for VR Meetings",
        "description":  "Meta showcases avatars with detailed facial expressions and natural motion to improve virtual collaboration.",
        "content":  "Meta has released a new generation of VR avatars that capture ultra-realistic facial expressions and smoother body motion, aimed at making remote meetings feel more natural. The update uses improved capture algorithms and on-device synthesis to preserve privacy while enhancing presence.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?virtual-reality,avatar,metaverse",
        "category":  "News",
        "tags":  [
                     "Meta",
                     "VR",
                     "avatars",
                     "meetings"
                 ],
        "slug":  "meta-introduces-ultra-realistic-avatars-for-vr-meetings",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?virtual-reality,avatar,metaverse"
    },
    {
        "id":  10,
        "title":  "WHO Releases Updated Report on Global Nutrition 2025",
        "description":  "The WHO publishes a comprehensive report highlighting global nutrition trends, challenges and recommendations for 2025.",
        "content":  "The World Health Organization released its 2025 Global Nutrition Report today, presenting updated data on malnutrition, obesity, and micronutrient deficiencies. The report emphasizes policy interventions, community nutrition programs, and international cooperation to address growing disparities.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?nutrition,health,food",
        "category":  "News",
        "tags":  [
                     "WHO",
                     "health",
                     "nutrition",
                     "report"
                 ],
        "slug":  "who-releases-updated-report-on-global-nutrition-2025",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?nutrition,health,food"
    },
    {
        "id":  11,
        "title":  "Amazon Launches Drone Delivery Service in Bengaluru",
        "description":  "Amazon begins a pilot drone delivery service in Bengaluru to speed up small-package logistics in select neighbourhoods.",
        "content":  "Amazon today started a pilot program for drone deliveries in Bengaluru, offering same-day transport for small packages over short distances. The initiative uses automated route planning and designated landing pads to ensure safe operations in urban environments.",
        "date":  "2025-11-23",
        "image":  "https://source.unsplash.com/1600x900/?drone,delivery,city",
        "category":  "News",
        "tags":  [
                     "Amazon",
                     "drone",
                     "delivery",
                     "Bengaluru"
                 ],
        "slug":  "amazon-launches-drone-delivery-service-in-bengaluru",
        "views":  0,
        "og_image":  "https://source.unsplash.com/1200x630/?drone,delivery,city"
    }
    ,
    {
        "id": 12,
        "title": "Japan Hit by 6.8-Magnitude Earthquake, Tsunami Warning Issued",
        "description": "A strong 6.8 earthquake struck Japan’s northeast region early today, prompting emergency tsunami alerts and widespread transportation disruption.",
        "content": "A powerful 6.8-magnitude earthquake shook Japan’s northeastern coastal region today at 5:42 AM local time, sending tremors felt as far as Tokyo. The Japan Meteorological Agency immediately issued a tsunami warning for prefectures along the Pacific coast. Authorities temporarily halted Shinkansen bullet trains and shut down airports in Fukushima and Miyagi for safety inspections. Minor fires and power outages were reported. PM Kishida confirmed emergency teams are on standby. Japan, located on the Pacific Ring of Fire, faces frequent seismic activity.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1504805572947-34fad45aed93",
        "category": "World News",
        "tags": ["japan","earthquake","tsunami","asia","natural disasters"],
        "slug": "japan-hit-by-6-8-magnitude-earthquake-tsunami-warning-issued",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1504805572947-34fad45aed93"
    },
    {
        "id": 13,
        "title": "UN Chief Warns Climate Change Is “Accelerating Beyond Predictions”",
        "description": "The UN has issued a severe climate warning, stating that global warming is advancing faster than scientific models expected.",
        "content": "UN Secretary-General António Guterres warned that climate change is “accelerating beyond predictions,” citing fresh WMO data. The report shows unprecedented temperature anomalies and record-breaking glacier melt. Guterres urged countries to phase out fossil fuels and scale renewable adoption. Environmental groups praised the urgency but criticized slow policy action among major economies. The next global summit is expected to revise climate commitments significantly.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1469474968028-56623f02e42e",
        "category": "World News",
        "tags": ["climate change","UN","global warming","environment"],
        "slug": "un-chief-warns-climate-change-is-accelerating-beyond-predictions",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1469474968028-56623f02e42e"
    },
    {
        "id": 14,
        "title": "Apple Introduces Next-Gen AI Assistant for iPhone",
        "description": "Apple unveiled a revolutionary AI assistant for iPhones, offering real-time reasoning, personalization, and offline intelligence.",
        "content": "Apple has revealed a next-generation AI assistant capable of real-time reasoning and deep contextual understanding. The assistant processes many tasks on-device, enhancing privacy and speed. Users can now summarize messages, generate images, and automate workflows with conversational prompts. Analysts say the move positions Apple competitively against Google Gemini and other leading AI models. The update ships with the next major iOS release.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1512499617640-c2f999098c53",
        "category": "World News",
        "tags": ["apple","ai","technology","iphone"],
        "slug": "apple-introduces-next-gen-ai-assistant-for-iphone",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1512499617640-c2f999098c53"
    },
    {
        "id": 15,
        "title": "India & China Hold High-Level Peace Talks After Border Tension",
        "description": "India and China conducted high-level military talks addressing ongoing border frictions in Ladakh.",
        "content": "India and China held their 22nd round of border talks to address tension along the LAC in eastern Ladakh. Discussions focused on de-escalation, disengagement in contested areas, and new communication channels to prevent incidents. Both countries expressed commitment to peace but unresolved issues remain regarding patrolling zones and troop withdrawal. Analysts note that mutual trust is still fragile.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1508615039623-a25605d2b022",
        "category": "World News",
        "tags": ["india","china","ladakh","border","diplomacy"],
        "slug": "india-and-china-hold-high-level-peace-talks-after-border-tension",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1508615039623-a25605d2b022"
    },
    {
        "id": 16,
        "title": "NASA Confirms Water Ice in Lunar South Pole Region",
        "description": "NASA scientists confirmed significant water-ice deposits in the Moon’s south pole, a breakthrough for future lunar missions.",
        "content": "NASA’s Lunar Reconnaissance Orbiter has detected extensive deposits of water ice in permanently shadowed craters at the Moon’s south pole. This discovery is crucial for the Artemis program, enabling astronauts to extract water for drinking, oxygen production, and fuel. NASA called the findings historic and vital for sustainable lunar habitation and future deep-space missions.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1544827942-61667d0119d5",
        "category": "World News",
        "tags": ["nasa","moon","space","science","artemis"],
        "slug": "nasa-confirms-water-ice-in-lunar-south-pole-region",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1544827942-61667d0119d5"
    },
    {
        "id": 17,
        "title": "Global Stock Markets Dip After Latest US Inflation Figures",
        "description": "World markets fell after US inflation rose unexpectedly, raising fears that interest-rate cuts may be delayed.",
        "content": "Global financial markets experienced declines after new US inflation numbers exceeded expectations. Investors fear prolonged high interest rates by the Federal Reserve. European and Asian indices opened lower, with tech and banking sectors seeing the steepest drops. Economists expect increased market volatility until central banks release updated monetary policy guidance.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1553729459-efe14ef6055d",
        "category": "World News",
        "tags": ["markets","finance","inflation","economy"],
        "slug": "global-stock-markets-dip-after-latest-us-inflation-figures",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1553729459-efe14ef6055d"
    },
    {
        "id": 18,
        "title": "UK Unveils New AI Safety Regulations for Tech Companies",
        "description": "The UK announced strict new AI safety regulations to govern deployment of advanced AI systems.",
        "content": "The UK introduced a comprehensive AI Safety Act requiring transparency, risk audits, and mandatory safety tests for high-risk AI systems. The government aims to balance innovation with public safety. PM Rishi Sunak noted that the UK intends to become a global leader in ethical AI development, aligning with similar initiatives in the US and EU.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1581091012184-5c75f8a96c3e",
        "category": "World News",
        "tags": ["ai","uk","regulation","technology"],
        "slug": "uk-unveils-new-ai-safety-regulations-for-tech-companies",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1581091012184-5c75f8a96c3e"
    },
    {
        "id": 19,
        "title": "Saudi Arabia Announces New Futuristic Smart Mega-City",
        "description": "Saudi Arabia revealed a massive next-generation smart city project powered by AI and renewable energy.",
        "content": "Saudi Arabia unveiled a new mega-city under Vision 2030. The city will be fully AI-driven, with autonomous transport, renewable energy systems, digital governance, and sustainable architecture. Construction begins next year and is expected to attract major global investment.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1505839673365-e3971f8d9184",
        "category": "World News",
        "tags": ["saudi arabia","smart city","technology","middle east"],
        "slug": "saudi-arabia-announces-new-futuristic-smart-mega-city",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1505839673365-e3971f8d9184"
    },
    {
        "id": 20,
        "title": "WHO Reports Major Decline in Global COVID-19 Cases",
        "description": "The WHO announced a worldwide drop in COVID-19 infections and hospitalizations.",
        "content": "WHO reports a 35% decline in global COVID-19 infections due to increased vaccination and natural immunity. Hospitalizations have dropped sharply but experts caution that surveillance must continue. Governments are moving from emergency response to long-term healthcare strategies.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1584036561578-16a37c2a0c34",
        "category": "World News",
        "tags": ["covid19","health","who","global health"],
        "slug": "who-reports-major-decline-in-global-covid-19-cases",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1584036561578-16a37c2a0c34"
    },
    {
        "id": 21,
        "title": "Global Electric Vehicle Sales Hit Record High in 2025",
        "description": "EV sales worldwide reached record highs driven by cheaper batteries and expanded charging networks.",
        "content": "EV sales hit an all-time high according to the IEA report. Falling battery prices, fast-charging expansion, and government incentives accelerated adoption. China, Europe, and India led global growth, with EVs expected to dominate auto markets in the coming decade.",
        "date": "2025-11-23",
        "image": "https://images.unsplash.com/photo-1611078489935-cb4d0b9c9aff",
        "category": "World News",
        "tags": ["ev","electric vehicles","energy","automobiles"],
        "slug": "global-electric-vehicle-sales-hit-record-high-in-2025",
        "views": 0,
        "og_image": "https://images.unsplash.com/photo-1611078489935-cb4d0b9c9aff"
    }
]
